In [1]:
import pandas as pd

In [43]:
lt = [range(1,21,2), range(2,21,2), range(10,101,10)]
df = pd.DataFrame(data=lt, columns=[f'co{idx}' for idx in range(1,11)])
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

# 값 변경

## 특정 위치의 값 변경

In [44]:
# 행 1 열 co2가 교차되는 값 변경
df.loc[1,'co2'] = 100
df.iloc[1,1] = 4
df['co2'][1] = 100
df.co2[1] = 4
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2  100    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [45]:
# co2의 값을 2배로 변경
df.co2 *= 2
# 0행의 값을 2배로 변경
# df.loc[0] *= 2
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    6    5    7    9   11   13   15   17    19
1    2  200    6    8   10   12   14   16   18    20
2   10   40   30   40   50   60   70   80   90   100

In [46]:
# 인덱스 0~1, 컬럼 co4 ~ co6의 값을 10 감소
df.loc[0:1, 'co4':'co6'] -= 10
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    6    5   -3   -1    1   13   15   17    19
1    2  200    6   -2    0    2   14   16   18    20
2   10   40   30   40   50   60   70   80   90   100

# 조건에 맞는 값 추출

In [ ]:
# 1) co2컬럼에서 8 데이터 추출
# 마스크 : 데이터프레임의 조건 비교

In [36]:
df.co2 == 8
df.loc[df.co2 == 8]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
1    2    8    6   -2    0    2   14   16   18    20

In [37]:
df.co2 == 8
df.loc[df.co2 == 8, 'co2']

1    8
Name: co2, dtype: int64

In [38]:
df.co2 == 8
df.loc[df.co2 == 8, ['co2', 'co4', 'co6']]

   co2  co4  co6
1    8   -2    2

In [50]:
# 컬럼 co7에서 홀수인 행만 추출
df.co7 % 2 == 1
df.loc[df.co7 % 2 == 1, 'co7']

0    13
Name: co7, dtype: int64